<?php
include_once(dirname(__FILE__).'/inc.php');
actionHook(basename(__FILE__).'.start'); // 해당 파일 시작에 대한 후킹액션 실행

$ool_bank_name_array = array(
	'39'=>'경남',
	'34'=>'광주',
	'04'=>'국민',
	'03'=>'기업',
	'11'=>'농협',
	'31'=>'대구',
	'32'=>'부산',
	'02'=>'산업',
	'45'=>'새마을금고',
	'07'=>'수협',
	'88'=>'신한',
	'48'=>'신협',
	'05'=>'외환',
	'20'=>'우리',
	'71'=>'우체국',
	'37'=>'전북',
	'35'=>'제주',
	'81'=>'하나',
	'27'=>'한국씨티',
	'23'=>'SC은행',
	'09'=>'동양증권',
	'78'=>'신한금융투자증권',
	'40'=>'삼성증권',
	'30'=>'미래에셋증권',
	'43'=>'한국투자증권',
	'69'=>'한화증권'
);

 /***************************************************************************************************************
 * 올더게이트로부터 가상계좌 입/출금 데이타를 받아서 상점에서 처리 한 후
 * 올더게이트로 다시 응답값을 리턴하는 페이지입니다.
 * 상점 DB처리 부분을 업체에 맞게 수정하여 작업하시기 바랍니다.
***************************************************************************************************************/

/*********************************** 올더게이트로 부터 넘겨 받는 값들 시작 *************************************/
$trcode     = trim( $_POST["trcode"] );					    //거래코드
$service_id = trim( $_POST["service_id"] );					//상점아이디
$orderdt    = trim( $_POST["orderdt"] );				    //승인일자
$virno      = trim( $_POST["virno"] );				        //가상계좌번호
$deal_won   = trim( $_POST["deal_won"] );					//입금액
$ordno		= trim( $_POST["ordno"] );                      //주문번호
$inputnm	= trim( $_POST["inputnm"] );					//입금자명
/*********************************** 올더게이트로 부터 넘겨 받는 값들 끝 *************************************/

/***************************************************************************************************************
 * 상점에서 해당 거래에 대한 처리 db 처리 등....
 *
 * trcode = "1" ☞ 일반가상계좌 입금통보전문
 * trcode = "2" ☞ 일반가상계좌 취소통보전문
 *
***************************************************************************************************************/

if($trcode == '1') { // 입금

	_MQ_noreturn("
		update smart_order_onlinelog set ool_amount_current = '$deal_won', ool_respdate = '$orderdt', ool_type='I' where ool_ordernum = '$ordno'
    ");
	$r = _MQ("select * from smart_order_onlinelog as ol inner join smart_order as o on (o.o_ordernum=ol.ool_ordernum) where ol.ool_ordernum='$ordno' order by ol.ool_uid desc limit 1");

	// - 2016-09-05 ::: JJC ::: 주문정보 추출 ::: 가상계좌 - 이미 결제가 되었다면 추가 적용을 하지 않게 처리함. ---
	$iosr = get_order_info($ordno);

	if($r[ool_amount_total] == $r[ool_amount_current] && $iosr['o_paystatus'] <> "Y" ) {

		// ----- SSJ : 2020-07-01 : 결제완료/결제취소 일괄처리 -----
		// 공통결제
		//		넘길변수
		//			-> 주문번호 : $ordernum
		$ordernum = $ordno;
		include(OD_PROGRAM_ROOT."/shop.order.result.pro.php"); // ----- SSJ : 2020-07-01 : 결제완료/결제취소 일괄처리 -----
		//if($pay_status == 'N') {$rSuccYn = 'n';}// 실패처리
		// ----- SSJ : 2020-07-01 : 결제완료/결제취소 일괄처리 -----

	}
	$rSuccYn = ($pay_status == 'N' ? "n" : "y");// ----- SSJ : 2020-07-01 : 결제완료/결제취소 일괄처리 -----
}

else if($trcode == '2') { // 취소


	$rSuccYn = 'y';
}

else {
	$rSuccYn = 'n';
}


/******************************************처리 결과 리턴******************************************************/
$rResMsg  = "";
//$rSuccYn  = "y";// 정상 : y 실패 : n

//정상처리 경우 거래코드|상점아이디|주문일시|가상계좌번호|처리결과|
$rResMsg .= $trcode."|";
$rResMsg .= $service_id."|";
$rResMsg .= $orderdt."|";
$rResMsg .= $virno."|";
$rResMsg .= $rSuccYn."|";

actionHook(basename(__FILE__).'.end'); // 해당 파일 종료에 대한 후킹액션 실행
echo $rResMsg;
/******************************************처리 결과 리턴******************************************************/